# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
#  - [19,28, 34,22, 34,48]  #1/4 to our dataset
#  - [53,34, 24,66, 71,24]  #1/8
#  - [57,59, 40,87, 87,41]   #1/16
#  - [62,87, 86,64, 102,100]  #1/32
  - [16,23, 32,31, 17,59]  #1/4
  - [61,36, 48,70, 27,105]  #1/8
  - [124,56, 97,117, 49,169]   #1/16
  - [208,77, 72,277, 227,225]  #1/32
# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],                           #6
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, HSPP, [1024]],
   [-1, 1, CA, [1024]],
   [-1, 3, C3, [1024, False]],  # 10
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #256*40*40
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 1/16

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],     #128*80*80
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 18 (P3/8-small)

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],     #128*160*160
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 1/4 #128*160*160    P22

   [-1, 1, Conv, [256, 3, 2]],  #128*80*80
   [[-1, 17, 4],  1, Concat, [1]],
   [-1, 3, C3, [256, False]],      #1/8 128*80*80     P25

   [-1, 1, Conv, [512, 3, 2]],  #256*40*40
   [[-1, 13, 6],   1, Concat, [1]],
   [-1, 3, C3, [512, False]],      #1/16 256*40*40    P28

   [-1, 1, Conv, [1024, 3, 2]],  #512*20*20
   [[-1, 10], 1, Concat, [1]],
   [-1, 3, C3, [1024, False]],     #1/32 512*20*20    P31

   [[22, 25, 28, 31], 1, Detect, [nc, anchors]],
  ]
